Tekla.Structures.Analysis.AnalysisModelDesignProperties.DesignMethodEnum
The design methods.

Tekla.Structures.Analysis.AnalysisModelDesignProperties.DesignMethodEnum.NONE
The design method is none.

Tekla.Structures.Analysis.AnalysisModelDesignProperties.DesignMethodEnum.CHECK_DESIGN
The design method is check design.

Tekla.Structures.Analysis.AnalysisModelDesignProperties.DesignMethodEnum.OPTIMISE
The design method is optimise.